Gonzalogontad/ProyectoFinalCESEGG/Soft/modPrincipalCIAA/src/Esp8266FreeRTOS.c
/*==================[inlcusiones]============================================*/

#include "Esp8266FreeRTOS.h"

#include "sapi.h"
#include <string.h>
#include "sapi_stdio.h"
#include "webPage.h"
#include "sapi_convert.h"
#include "UARTEspDriver.h"
#include "interpreter.h"

/*==================[definiciones y macros]==================================*/

#define ESP8266_UART          UART_232
#define ESP8266_BAUD_RATE     115200
#define ESP8266_TMO           5000
#define ESP8266_PAUSE         5000
#define ESP8266_WAIT          1000

#define MAX_COMMAND_LENGHT	   40
#define MAX_HTTP_WEB_LENGHT   2047

typedef enum Esp8266State
{
	ESP_INIT,
	ESP_SEND_AT,
	ESP_WAIT_AT,
	ESP_SEND_CWJAP_CONS,
	ESP_WAIT_CWJAP_CONS_1,
	ESP_WAIT_CWJAP_CONS_2,
	ESP_SEND_CWMODE_SET,
	ESP_WAIT_CWMODE_SET,
	ESP_SEND_CWJAP_SET,
	ESP_WAIT_CWJAP_SET_1,
	ESP_WAIT_CWJAP_SET_2,
	ESP_WAIT_CWJAP_SET_3,
	ESP_CONNECTED,
	ESP_SEND_START,
	ESP_WAIT_START_1,
	ESP_WAIT_START_2,
	ESP_SEND_SEND,
	ESP_WAIT_SEND,
	ESP_SEND_DATA,
	ESP_WAIT_DATA_1,
	ESP_WAIT_DATA_2,
	ESP_CIPMUX_SEND,
	ESP_WAIT_CIPMUX,
	ESP_SEND_CIPSERVER,
	ESP_WAIT_CIPSERVER,
	ESP_WAIT_GET,
	ESP_SEND_CIPSTATUS,
	ESP_WAIT_CIPSTATUS_3,
	ESP_WAIT_GET_ID,
	ESP_SEND_CIPSEND,
	ESP_WAIT_CIPSEND,
	ESP_SEND_HTTP,
	ESP_WAIT_HTTP,
	ESP_WAIT_CIPSTATUS_OK,
	ESP_WAIT_CIPSTATUS,
	ESP_SEND_CIPCLOSE,
	ESP_WAIT_CIPCLOSE,
	ESP_SEND_CIFSR,
	ESP_WAIT_CIFSR,
	ESP_LOAD_IP,
	ESP_SEND_CWMODE,
	ESP_WAIT_CWMODE,
	ESP_WAIT_IPD,
	ESP_GET_REQUEST_ID,
	ESP_WAIT_COMMA,
	ESP_GET_REQUEST_LENGTH,
	ESP_GET_REQUEST,

} Esp8266Status_t;

/*==================[definiciones de datos internos]=========================*/

//Nombres de los estados en forma de strings para imprimir por pantalla.
static const char Esp8266StatusToString[][MAX_COMMAND_LENGHT] =
{ "ESP_INIT", "ESP_SEND_AT", "ESP_WAIT_AT", "ESP_SEND_CWJAP_CONS",
		"ESP_WAIT_CWJAP_CONS_1", "ESP_WAIT_CWJAP_CONS_2", "ESP_SEND_CWMODE_SET",
		"ESP_WAIT_CWMODE_SET", "ESP_SEND_CWJAP_SET", "ESP_WAIT_CWJAP_SET_1",
		"ESP_WAIT_CWJAP_SET_2", "ESP_WAIT_CWJAP_SET_3", "ESP_CONNECTED",
		"ESP_SEND_START", "ESP_WAIT_START_1", "ESP_WAIT_START_2",
		"ESP_SEND_SEND", "ESP_WAIT_SEND", "ESP_SEND_DATA", "ESP_WAIT_DATA_1",
		"ESP_WAIT_DATA_2", "ESP_CIPMUX_SEND", "ESP_WAIT_CIPMUX",
		"ESP_SEND_CIPSERVER", "ESP_WAIT_CIPSERVER", "ESP_WAIT_GET",
		"ESP_SEND_CIPSTATUS", "ESP_WAIT_CIPSTATUS_3", "ESP_WAIT_GET_ID",
		"ESP_SEND_CIPSEND", "ESP_WAIT_CIPSEND", "ESP_SEND_HTTP",
		"ESP_WAIT_HTTP", "ESP_WAIT_CIPSTATUS_OK", "ESP_WAIT_CIPSTATUS",
		"ESP_SEND_CIPCLOSE", "ESP_WAIT_CIPCLOSE", "ESP_SEND_CIFSR",
		"ESP_WAIT_CIFSR", "ESP_LOAD_IP", "ESP_SEND_CWMODE", "ESP_WAIT_CWMODE",
		"ESP_WAIT_IPD", "ESP_GET_REQUEST_ID", "ESP_WAIT_COMMA",
		"ESP_GET_REQUEST_LENGTH", "ESP_GET_REQUEST", };
// Respuestas del ESP8266
static const char Response_OK[] 		= "OK";
static const char Response_CWJAP_OK[] 	= "+CWJAP:";
static const char Response_CWJAP_1[] 	= "WIFI CONNECTED";
static const char Response_CWJAP_2[] 	= "WIFI GOT IP";
static const char Response_SEND_OK[] 	= "SEND OK";
static const char Response_STATUS_3[] 	= "STATUS:3";
static const char Response_CIPSTATUS[] 	= "+CIPSTATUS:";
static const char Response_CIPCLOSE[] 	= "CLOSED";
static const char Response_CIFSR[] 		= "+CIFSR:STAIP,\"";
static const char Response_IPD[] 		= "+IPD,";
static const char Response_COMMA[] 		= ",";

// Memoria asociada a las conexiones
static uint8_t CurrentConnectionId;
static uint8_t CurrentReqLength;
static char WifiName[30] = "";
static char WifiPass[30] = "";
static char WifiIp[20];
// Punteros a la pagina web a mostrar
static char * PointerOfHttpWebPage;
char * requestAnswer;
// Variables utilizadas en la maquina de estados.
static const char * Esp8266ResponseToWait;
static delay_t Esp8266Delay;
static uint8_t Esp8266Status = ESP_INIT;
static uartMap_t Esp8266DebugUart = UART_USB;
static uint32_t Esp8266DebugBaudRate = 115200;
static UARTData_t UARTEsp;

static char rawRequest [256]; //string donde guardo el request

/*==================[definiciones de datos externos]=========================*/

/*==================[declaraciones de funciones internas]====================*/

static bool_t IsWaitedResponse(void);
static void SetEsp8622Status(uint8_t statusToSend);
static void ExcecuteHttpServerFsm(void);

/*==================[declaraciones de funciones externas]====================*/

/**
 * Funcion para obtener la direccion IP del modulo Esp8266
 * @return devuelve un puntero al arreglo local donde esta alojado el dato.
 */
char * gesp8266GetIpAddress()
{
	return WifiIp;
}

/**
 * Funcion para obtener el nombre de la red del modulo Esp8266
 * @return devuelve un puntero al arreglo local donde esta alojado el dato.
 */
char * gesp8266GetWifiName()
{
	return WifiName;
}

/**
 * Funcion para obtener la contrasenia de la red del modulo Esp8266
 * @return devuelve un puntero al arreglo local donde esta alojado el dato.
 */
char * gesp8266GetWifiPass()
{
	return WifiPass;
}

/**
 * Devuelve al usuario el indice de la conexion establecida
 * @return un entero correspondiente a
 */
uint8_t gesp8266GetConnectionId()
{
	return CurrentConnectionId - '0';
}

/**
 * Configura la conexion para que el modulo Esp8266 sea un servidor HTTP.
 * Realiza llamadas no bloqueantes a la maquina de estados que maneja la conexion.
 * La variable parametersReceived sirve para cargar por unica vez los datos de la red
 * @param wifiName puntero con el nombre de la red Wifi
 * @param wifiPass puntero con la contrasenia de la red Wifi
 * @param debugUart es la uart por donde va a reportar los datos. Este parametro es opcional, poner 0 sino se necesita.
 * @param debugBaudRate es la velocidad de la uart de debug. Poner en 0 si no se necesita.
 * @return TRUE si se configuro correctamente como servidor HTTP, FALSE caso contrario.
 */
bool_t gesp8266InitHttpServer(char * wifiName, char * wifiPass)
{
	static bool_t parametersReceived = FALSE;

	if (!parametersReceived)
	{
		strcpy(WifiName, wifiName);
		strcpy(WifiPass, wifiPass);
		SetEsp8622Status(ESP_INIT);
		parametersReceived = TRUE;
	}
	ExcecuteHttpServerFsm();

	return (Esp8266Status == ESP_WAIT_IPD); //si llego al estado ESP_WAIT_IPD es porque el modulo ya esta configurado.
											//Cuando vuelva a ejecutar la maquina de estados se va a esperar algun Request.
}

/**
 * Funcion para determinar si hay alguna peticion HTTP realizada desde una
 * pagina web, realizada por algun cliente.
 * Ademas realiza llamadas no bloqueantes a la maquina de estados del
 * modulo que administra las conexiones y peticiones de clientes.
 * @return TRUE si se recibio una peticion, FALSE caso contrario.
 */
bool_t gesp8266ReadHttpServer()
{
	ExcecuteHttpServerFsm();
	return (Esp8266Status == ESP_SEND_CIPSEND); //si la FSM llego al estado ESP_SEND_CIPSEND significa que ya llego una peticion
}

/**
 * Funcion para enviar una pagina web actualizada en respuesta a la
 * peticion del cliente.
 * Corrobora quue haya una peticion real del usuario antes de enviar datos.
 * Si hay una peticion, carga en los punteros correspondientes toda la
 * pagina web que se le enviara al cliente.
 * Un detalle importante es que tanto el header como el end de la web son
 * constantes, ya que se supone que no cambian a lo largo del programa.
 * Lo que si cambiara es el body HTTP que es el que contiene la informacion
 * actualizada del estado del sistema.
 * @param webHttpHeader puntero al header http (debe ser parte de la aplicacion de usuario).
 * @param webHttpBody puntero al body http (debe ser parte de la aplicacion de usuario).
 * @param webHttpEnd puntero al end http (debe ser parte de la aplicacion de usuario).
 * @return TRUE si pudo mandar la web correctamente, FALSE caso contrario.
 */
bool_t gesp8266WriteHttpServer(const char * answer)
{
	//antes de enviar se asegura que haya datos pendientes para enviar
	if (Esp8266Status == ESP_SEND_CIPSEND)
	{
		PointerOfHttpWebPage = answer;

