Gonzalogontad/ProyectoFinalCESEGG/Soft/modPrincipalCIAA/src/Esp8266FreeRTOS.c
	}
	ExcecuteHttpServerFsm();

	return (Esp8266Status == ESP_SEND_CIPCLOSE);
}

/*==================[definiciones de funciones internas]=====================*/

/**
 * Funcion principal del modulo Wifi Esp8266 para funcionar como servidor HTTP.
 * Desde aca se manejan los comandos a enviar, los tiempos a esperar y
 * las respuestas a recibir.
 * Automaticamente cambia de estados en funcion de los eventos que ocurran.
 */
static void ExcecuteHttpServerFsm(void)
{
	uint16_t lenghtOfHttpLines;
	static uint16_t i;
	static uint8_t byteReceived, auxIndex;

	UARTEsp.uartValue=ESP8266_UART;
	UARTEsp.baudRate=ESP8266_BAUD_RATE;

	switch (Esp8266Status)
	{

	case ESP_INIT:


		if (Esp8266DebugBaudRate > 0)
		{
			uartConfig(Esp8266DebugUart, Esp8266DebugBaudRate);
		}
		if(UARTEspInit(&UARTEsp)==false)
		{
			stdioPrintf(Esp8266DebugUart, "Error al incializar UART ESP");
		}
		delayConfig(&Esp8266Delay, ESP8266_PAUSE);
		SetEsp8622Status(ESP_SEND_AT);
		break;

	case ESP_SEND_AT:
		if (delayRead(&Esp8266Delay))
		{
			stdioPrintf(ESP8266_UART, "AT\r\n");
			Esp8266ResponseToWait = Response_OK;
			delayConfig(&Esp8266Delay, ESP8266_TMO);
			SetEsp8622Status(ESP_WAIT_AT);
		}
		break;

	case ESP_WAIT_AT:
		if (IsWaitedResponse())
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_CWMODE);
		}
		//Si no recibe OK vuelve a enviar AT
		if (delayRead(&Esp8266Delay))
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_AT);
		}
		break;

	case ESP_SEND_CWMODE:
		if (delayRead(&Esp8266Delay))
		{
			stdioPrintf(ESP8266_UART, "AT+CWMODE=3\r\n");
			Esp8266ResponseToWait = Response_OK;
			delayConfig(&Esp8266Delay, ESP8266_TMO);
			SetEsp8622Status(ESP_WAIT_CWMODE);
		}
		break;

	case ESP_WAIT_CWMODE:
		if (IsWaitedResponse())
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_CWJAP_CONS);
		}
		//Si no recibe OK vuelve a enviar AT
		if (delayRead(&Esp8266Delay))
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_CWMODE);
		}
		break;

	case ESP_SEND_CWJAP_CONS:
		if (delayRead(&Esp8266Delay))
		{
			stdioPrintf(ESP8266_UART, "AT+CWJAP?\r\n");
			Esp8266ResponseToWait = Response_CWJAP_OK;
			delayConfig(&Esp8266Delay, ESP8266_TMO);
			SetEsp8622Status(ESP_WAIT_CWJAP_CONS_1);
		}
		break;

	case ESP_WAIT_CWJAP_CONS_1:
		if (IsWaitedResponse())
		{
			Esp8266ResponseToWait = Response_OK;
			SetEsp8622Status(ESP_WAIT_CWJAP_CONS_2);
		}
		if (delayRead(&Esp8266Delay))
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_CWMODE_SET);
		}
		break;

	case ESP_WAIT_CWJAP_CONS_2:
		if (IsWaitedResponse())
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_CIPMUX_SEND);
		}
		if (delayRead(&Esp8266Delay))
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_AT);
		}
		break;

	case ESP_SEND_CWMODE_SET:
		if (delayRead(&Esp8266Delay))
		{
			stdioPrintf(ESP8266_UART, "AT+CWMODE=3\r\n");
			Esp8266ResponseToWait = Response_OK;
			delayConfig(&Esp8266Delay, ESP8266_TMO);
			SetEsp8622Status(ESP_WAIT_CWMODE_SET);
		}
		break;

	case ESP_WAIT_CWMODE_SET:
		if (IsWaitedResponse())
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_CWJAP_SET);
		}
		if (delayRead(&Esp8266Delay))
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_AT);
		}
		break;

	case ESP_SEND_CWJAP_SET:
		if (delayRead(&Esp8266Delay))
		{
			stdioPrintf(ESP8266_UART, "AT+CWJAP=\"%s\",\"%s\"", WifiName,
					WifiPass);
			Esp8266ResponseToWait = Response_CWJAP_1;
			delayConfig(&Esp8266Delay, ESP8266_TMO);
			SetEsp8622Status(ESP_WAIT_CWJAP_SET_1);
		}
		break;

	case ESP_WAIT_CWJAP_SET_1:
		if (IsWaitedResponse())
		{
			Esp8266ResponseToWait = Response_CWJAP_2;
			SetEsp8622Status(ESP_WAIT_CWJAP_SET_2);
		}
		if (delayRead(&Esp8266Delay))
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_AT);
		}
		break;

	case ESP_WAIT_CWJAP_SET_2:
		if (IsWaitedResponse())
		{
			Esp8266ResponseToWait = Response_OK;
			SetEsp8622Status(ESP_WAIT_CWJAP_SET_3);
		}
		if (delayRead(&Esp8266Delay))
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_AT);
		}
		break;

	case ESP_WAIT_CWJAP_SET_3:
		if (IsWaitedResponse())
			SetEsp8622Status(ESP_CIPMUX_SEND);
		if (delayRead(&Esp8266Delay))
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_AT);
		}
		break;

	case ESP_CIPMUX_SEND:
		if (delayRead(&Esp8266Delay))
		{
			stdioPrintf(ESP8266_UART, "AT+CIPMUX=1\r\n");
			Esp8266ResponseToWait = Response_OK;
			delayConfig(&Esp8266Delay, ESP8266_TMO);
			SetEsp8622Status(ESP_WAIT_CIPMUX);
			auxIndex = 0;
		}
		break;

	case ESP_WAIT_CIPMUX:
		if (IsWaitedResponse())
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_CIPSERVER);
		}
		if (delayRead(&Esp8266Delay))
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			// cierra todas las posibles conexioes
			stdioPrintf(ESP8266_UART, "AT+CIPCLOSE=%d\r\n", auxIndex);
			if (++auxIndex >= 4)
			{
				SetEsp8622Status(ESP_CIPMUX_SEND);
			}
		}
		break;

	case ESP_SEND_CIPSERVER:
		if (delayRead(&Esp8266Delay))
		{
			stdioPrintf(ESP8266_UART, "AT+CIPSERVER=1,80\r\n");
			Esp8266ResponseToWait = Response_OK;
			delayConfig(&Esp8266Delay, ESP8266_TMO);
			SetEsp8622Status(ESP_WAIT_CIPSERVER);
		}
		break;

	case ESP_WAIT_CIPSERVER:
		if (IsWaitedResponse())
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_CIFSR);
		}
		if (delayRead(&Esp8266Delay))
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_AT);
		}
		break;

	case ESP_SEND_CIFSR:
		if (delayRead(&Esp8266Delay))
		{
			stdioPrintf(ESP8266_UART, "AT+CIFSR\r\n");
			Esp8266ResponseToWait = Response_CIFSR;
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_WAIT_CIFSR);
		}
		break;

	case ESP_WAIT_CIFSR:
		if (IsWaitedResponse())
		{
			SetEsp8622Status(ESP_LOAD_IP);
			auxIndex = 0;
		}
		if (delayRead(&Esp8266Delay))
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_CIFSR);
		}
		break;

		//Recibe byte a byte la direccion IP y la almacena en WifiIp
	case ESP_LOAD_IP:
		//if (uartReadByte(ESP8266_UART, &byteReceived))
		if ( receiveEspByte(&UARTEsp,&byteReceived,10))
		{
			if (byteReceived != '"')
			{
				WifiIp[auxIndex] = byteReceived;
				auxIndex++;
			}
			else
			{
				WifiIp[auxIndex] = '\0';
				Esp8266ResponseToWait = Response_IPD;
				SetEsp8622Status(ESP_WAIT_IPD);
			}
		}
		break;

		// En este estado el modulo ya esta configurado como servidor HTTP
		// entonces cada vez que pasa el delay ESP8266_PAUSE mediante
		// el compando CIP_STATUS le pregunta al moduloWifi si hay una nueva peticion

		//continuar aca

	case ESP_WAIT_IPD:
		if (IsWaitedResponse())
		{			//Espero a que llegue "+IPD,";
			SetEsp8622Status(ESP_GET_REQUEST_ID);
		}
		if (delayRead(&Esp8266Delay))
		{			//espero un tiempo
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_WAIT_IPD);
		}
		break;

	case ESP_GET_REQUEST_ID:
		//if (uartReadByte(ESP8266_UART, &byteReceived))
		if ( receiveEspByte(&UARTEsp,&byteReceived,10))
		{	//leo el byte que corresponde al ID
			CurrentConnectionId = byteReceived;
			Esp8266ResponseToWait = Response_COMMA;
			SetEsp8622Status(ESP_WAIT_COMMA);
		}
		break;
	case ESP_WAIT_COMMA:
		if (IsWaitedResponse())
		{
			SetEsp8622Status(ESP_GET_REQUEST_LENGTH);
		}
		if (delayRead(&Esp8266Delay))
		{			//espero un tiempo
			Esp8266ResponseToWait = Response_IPD;
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_WAIT_IPD);
		}
		break;

	case ESP_GET_REQUEST_LENGTH:
		//if (uartReadByte(ESP8266_UART, &byteReceived))
		if ( receiveEspByte(&UARTEsp,&byteReceived,10))
		{	//leo un byte de la UART y me fijo si ya empieza la Request
			if (byteReceived != ':'&& byteReceived >= '0' && byteReceived <= '9')
			{
				CurrentReqLength = (CurrentReqLength * 10)
						+ (byteReceived - '0'); //guardo el valor de la longituda de la request.
				SetEsp8622Status(ESP_GET_REQUEST_LENGTH);
			}
			else
			{
				if(CurrentReqLength > 255)
					CurrentReqLength = 255; //limito el tamano del request a 256 bytes
				i=0; //reinicio el indice del request
				SetEsp8622Status(ESP_GET_REQUEST);
			}
		}
		break;
	case ESP_GET_REQUEST:

			//if (uartReadByte(ESP8266_UART, &byteReceived))
			if ( receiveEspByte(&UARTEsp,&byteReceived,10))
			{	//leo los bytes de la Request

				if (byteReceived != 0x0D && byteReceived != 0x0A ) //si es distinto de CR o LF (enter)
				{
					rawRequest[i]=byteReceived;
					i++;
					SetEsp8622Status(ESP_GET_REQUEST);
				}
				else
				{
					rawRequest[i]=0;
					requestCallback(rawRequest, i); //envio al callback del request la request completa (GET + algo) y el tamaño de la request

					//SetEsp8622Status(ESP_GET_REQUEST);
					SetEsp8622Status(ESP_SEND_CIPSEND);
				}
			}
			break;

		/*      static const char Response_OK[] = "OK";
		 static const char Response_CWJAP_OK[] = "+CWJAP:";
		 static const char Response_CWJAP_1[] = "WIFI CONNECTED";
		 static const char Response_CWJAP_2[] = "WIFI GOT IP";
		 static const char Response_SEND_OK[] = "SEND OK";
		 static const char Response_STATUS_3[] = "STATUS:3";
		 static const char Response_CIPSTATUS[] = "+CIPSTATUS:";
		 static const char Response_CIPCLOSE[] = "CLOSED";
		 static const char Response_CIFSR[] = "+CIFSR:STAIP,\"";
		 static const char Response_IPD[] = "+IPD,";
		 */

