Gonzalogontad/ProyectoFinalCESEGG/Soft/modPrincipalCIAA/src/Esp8266FreeRTOS.c
		//En este estado le dice al modulo cuantos bytes va a mandar
		// El comando esta compuesto por el comando CIPSEND, mas el ID
		// de la conexion abierta, mas la cantidad en ASCII de los bytes
		// que tiene la pagina web (o al menos los bytes de la primer linea).
	case ESP_SEND_CIPSEND:
		lenghtOfHttpLines = (strlen(PointerOfHttpWebPage));
		// Si se pasa del maximo largo permitido lo avisa en la web
		if (lenghtOfHttpLines >= MAX_HTTP_WEB_LENGHT)
		{
			stdioSprintf(PointerOfHttpWebPage,
					"ERROR: La longitud de datos HTTP supera el maximo permitido de %d bytes.",
					MAX_HTTP_WEB_LENGHT);
			lenghtOfHttpLines = (strlen(PointerOfHttpWebPage));
		}
		stdioPrintf(ESP8266_UART, "AT+CIPSEND=%c,%d\r\n", CurrentConnectionId,
				lenghtOfHttpLines);
		delayConfig(&Esp8266Delay, ESP8266_PAUSE);
		SetEsp8622Status(ESP_WAIT_CIPSEND);
		Esp8266ResponseToWait = Response_OK;
		break;

	case ESP_WAIT_CIPSEND:
		if (IsWaitedResponse())
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_HTTP);
		}
		if (delayRead(&Esp8266Delay))
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			Esp8266ResponseToWait = Response_IPD;
			SetEsp8622Status(ESP_WAIT_IPD);
		}
		break;

	case ESP_SEND_HTTP:
		stdioPrintf(ESP8266_UART, "%s",PointerOfHttpWebPage);
		SetEsp8622Status(ESP_WAIT_HTTP);
		Esp8266ResponseToWait = Response_SEND_OK;
		break;

	case ESP_WAIT_HTTP:
		if (IsWaitedResponse())
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_CIPCLOSE);
		}
		if (delayRead(&Esp8266Delay))
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			SetEsp8622Status(ESP_SEND_CIPSEND);
		}
		break;

	case ESP_SEND_CIPCLOSE:
		//if (delayRead(&Esp8266Delay))
		//{
			stdioPrintf(ESP8266_UART, "AT+CIPCLOSE=%c\r\n",
					CurrentConnectionId);
			//Esp8266ResponseToWait = Response_CIPCLOSE;
			delayConfig(&Esp8266Delay, 100);
			Esp8266ResponseToWait = Response_IPD;
			SetEsp8622Status(ESP_WAIT_IPD);
			//SetEsp8622Status(ESP_WAIT_CIPCLOSE);
		//}
		break;

	case ESP_WAIT_CIPCLOSE:
		if (IsWaitedResponse())
		{
			delayConfig(&Esp8266Delay, 1);
			Esp8266ResponseToWait = Response_IPD;
			SetEsp8622Status(ESP_WAIT_IPD);
		}
		if (delayRead(&Esp8266Delay))
		{
			delayConfig(&Esp8266Delay, ESP8266_PAUSE);
			Esp8266ResponseToWait = Response_IPD;
			SetEsp8622Status(ESP_WAIT_IPD);
		}
		break;
	}
}

/**
 * Determina si la respuesta que envio el modulo Esp8266 al
 * sistema embebido sea correcta.
 * Dentro de esta funcion va leyendo datos de la UART asociada
 * al modulo Esp8266 hasta encontrar el patron de datos necesario.
 * @return TRUE si es la respuesta esperada, FALSE caso contrario.
 */
static bool_t IsWaitedResponse(void)
{
	static uint8_t index = 0;
	uint8_t byteReceived;
	bool_t moduleResponse = FALSE;

	//if (uartReadByte(ESP8266_UART, &byteReceived))
	if ( receiveEspByte(&UARTEsp,&byteReceived,10))
	{
		if (Esp8266DebugBaudRate > 0)
		{
			stdioPrintf(Esp8266DebugUart, "%c", byteReceived);
		}
		if (byteReceived == Esp8266ResponseToWait[index])
		{
			index++;
			if (Esp8266ResponseToWait[index] == '\0')
			{
				index = 0;
				moduleResponse = TRUE;
				if (Esp8266DebugBaudRate > 0)
				{
					stdioPrintf(Esp8266DebugUart, "\n\r", byteReceived);
				}
			}
		}
		else
		{
			index = 0;
		}
	}
	return moduleResponse;
}

/**
 * Setea el estado global del modulo Esp8266.
 * @param status Estado a setear.
 */
static void SetEsp8622Status(Esp8266Status_t status)
{
	Esp8266Status = status;
	if (Esp8266DebugBaudRate > 0)
	{
//		stdioPrintf(Esp8266DebugUart, "\n\rESP8266 State = %s\n\r", Esp8266StatusToString[status]);
	}
}

//Funcion que separa la request completa (*rawReq) en 3 strings y los devuelve por los punteros que apuntan
//a la seccion correspondiente de rawReq
//**methode: apunta a la parte de rawReq que es el metodo de la HTTP Request
//**request: apunta a la parte de rawReq que es la solicitud limpia de la HTTP Request
//**version: apunta a la parte de rawReq que la version del HTTP de la HTTP Request
//

void requestSeparate(char *rawReq, char **methode,char **request,char **HTTPVersion)
	{
	uint16_t i =0;
	 //puntero al metodo de la request
	 //puntero al comienzo de la reqeuest
	 //puntero al string de la version HTTP
	char *aux;

	//

	*methode=rawReq;
	*HTTPVersion = strstr(rawReq, "HTTP/");//busco el inicio del string de la version HTTP
	while (rawReq[i]!=' ')
		i++;
	rawReq[i]=0; 	//pongo fin de cadena entre GET y la request propiamente dicha para separar el
					//string en 3 strings (methode, request y HTTPVersion)
	*request=&rawReq[i+1]; //la request empieza un caracter despues del espacio que viene despues del GE

	aux=*HTTPVersion-sizeof(char);//poner el /0 antes de la posicion apuntada por HTTPVersion
	*aux=0;

	}
void requestCallback(char *rawReq, uint8_t reqLength){

stdioPrintf(UART_USB, "\n La request tiene una longitud de: %d \n",CurrentReqLength);
stdioPrintf(UART_USB, "\n La request completa es: %s \n",rawReq);
	  // GET / HTTP1.1
uint16_t i =0;
static char *methode; //puntero al metodo de la request
static char *request; //puntero al comienzo de la reqeuest
static char *HTTPVersion; //puntero al string de la version HTTP
static char *auxpointer1;
static char *auxpointer2;
char auxString[10];
uint32_t panel;
uint32_t buttonId;
//actualPanel=panel0;
command_t auxCommand; //Variable para guardar comandos que van a ser enviados al interprete

//separo la request completa en 3 bloques (metodo, request limpia y version de HTTP)
requestSeparate(rawReq,&methode,&request,&HTTPVersion);

if (!strcmp(methode,"GET"))
{
	if (!strcmp(request, "/"))
			requestAnswer=HttpWebPage;
	else
		{
		if (strstr(request, "/data"))
				{
			requestAnswer = actualPageData;
				}
		else
			if (strstr(request, "/button"))
							{
						requestAnswer = ok;
							}
			else
				if (strstr(request, "/panel"))
								{
							requestAnswer = actualPanel;
								}
				else
					if (strstr(request, "/body"))
									{
								requestAnswer = HttpBody;
									}
					else
						if (strstr(request, "/save"))
								{
							requestAnswer = actualPageData;
								}
						else
							requestAnswer = requestError;
		}
}
else
	if (!strcmp(methode,"POST"))
	{
		if (strstr(request, "/button$"))
		{
			//reemplazo los "$" por fin de cadena
			auxpointer1= strstr(request, "$"); //llego al primer signo $
			auxpointer1[0]=' ';
			auxpointer2= strstr(request, "$");
			//auxpointer2[0]=0;
			//auxCommand.panelNum = stringToInt(&auxpointer1[2]); //capturo el numero de panel
			auxCommand.panelNum = (uint8_t) (auxpointer1[1]-'0'); //capturo el numero de panel
			i=1;
			while ((i<4)&&(auxpointer2[i]!= 0))//
			//while (auxpointer2[i])//
					{
					gpioToggle( LED1 );
				//	gpioToggle( LED2 );
				//	gpioToggle( LED3 );
					auxCommand.buttonId[i-1]= auxpointer2[i];
					//auxCommand.buttonId[1]= auxpointer2[2];
//					auxCommand.buttonId[2]= auxpointer2[3];
					i++;
					}
			sendCommand(auxCommand);
			requestAnswer=ok;
		}
		else
		{
			if (strstr(request, "/save$"))
			{
				//reemplazo los "$" por fin de cadena
				auxpointer1= strstr(request, "$");
				auxpointer1[0]=0;
				auxpointer2= strstr(auxpointer1, "$");
				auxpointer2[0]=0;
				auxCommand.panelNum = stringToInt(&auxpointer1[1]); //capturo el numero de panel
				i=1;
				while ((i<4)&&(auxpointer2[i]!= 0))//el modulo envia un espacio entre la uri y la version HTML
						{
						auxCommand.buttonId[i-1]= auxpointer2[i];
						}

				//Capturo los parametros a guardar y los convierto a entero
				auxpointer1= strstr(request, "$data:[");//busco el primer parametro
				for (i=0;i<4;i++)
				{
					if (i=3)
						auxpointer2= strstr(auxpointer1, "]"); //para el cuarto parametro busco un ]
					else
						auxpointer2= strstr(auxpointer1, ","); //busco una coma y la reemplazo por 0
					auxpointer2[0]=0;
					auxCommand.parameters[i] = stringToInt(&auxpointer1[1]);
					auxpointer1=auxpointer2;
				}


				requestAnswer = actualPageData;
			}
			else
				requestAnswer = requestError;
		}
	}
	else
	{
		requestAnswer = requestError;
	}

stdioPrintf(UART_USB, "\n La request limpia es: %s \n",request);
stdioPrintf(UART_USB, "\n El metodo es: %s \n",methode);
stdioPrintf(UART_USB, "\n La version de HTTP es: %s \n",HTTPVersion);


//Con los tres segmentos separados queda identificar el metodo y luego la solicitud.

	return;
}


uint32_t stringToInt (char *str)
{
	uint32_t i;
	uint32_t result;
	result =0;
	for (i=0; i<(strlen(str));i++)
	{
		if ((str[i]<='9')&&(str[i]>='0'))
			{
			result=result*10;
			result = result +(str[i]-'0');
			}
	}
	return result;
}


/*==================[fin del archivo]========================================*/
